InformationRegisters/НастройкиПечатиОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПечатиОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВариантРазбивкиДокументовНаСтраницы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Настройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПредставлениеТипаОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеВариантаРазбивкиДокументовНаСтраницы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяСервиса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяОрганизация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Подразделение</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательСистемыМеркурий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПользователиСистемыМеркурий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойстваПользователяИБ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСистемаМеркурийЛогин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСистемаМеркурийПароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФизическоеЛицо</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/НастройкиПечатиОбъектов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция СписокОбъектовДляНастройкиПечати() Экспорт
	
	СписокОбъектов = Новый СписокЗначений;
	
	СписокОбъектов.Добавить(Метаданные.Документы.АннулированиеВСД.ПолноеИмя(), Метаданные.Документы.АннулированиеВСД.Представление());
	СписокОбъектов.Добавить(Метаданные.Документы.АннулированиеВСДГрупповое.ПолноеИмя(), Метаданные.Документы.АннулированиеВСДГрупповое.Представление());
	СписокОбъектов.Добавить(Метаданные.Документы.ВнесениеНомеровТранспортныхСредств.ПолноеИмя(), Метаданные.Документы.ВнесениеНомеровТранспортныхСредств.Представление());
	СписокОбъектов.Добавить(Метаданные.Документы.ВнесениеНомеровТранспортныхСредствГрупповое.ПолноеИмя(), Метаданные.Документы.ВнесениеНомеровТранспортныхСредствГрупповое.Представление());
	СписокОбъектов.Добавить(Метаданные.Документы.ВСД.ПолноеИмя(), Метаданные.Документы.ВСД.Представление());
	СписокОбъектов.Добавить(Метаданные.Документы.ПриходныеОперации.ПолноеИмя(), Метаданные.Документы.ПриходныеОперации.Представление());
	СписокОбъектов.Добавить(Метаданные.Документы.ПриходныеОперацииСводно.ПолноеИмя(), Метаданные.Документы.ПриходныеОперацииСводно.Представление());
	СписокОбъектов.Добавить(Метаданные.Документы.ТранспортныеОперации.ПолноеИмя(), Метаданные.Документы.ТранспортныеОперации.Представление());
	
	Возврат СписокОбъектов;
КонецФункции

Функция ВыриантыРазбивкиДокументовНаСтраницы() Экспорт
	
	СписокВариантов = Новый СписокЗначений;
	СписокВариантов.Добавить("ВсеДокументыНаОдномЛисте", "Все документы на одной странице");
	СписокВариантов.Добавить("КаждыйДокументОтдельно", "Каждый документ на отдельной странице");
	СписокВариантов.Добавить("Настраиваемый", "Настраиваемый");
	
	Возврат СписокВариантов;
КонецФункции

Функция КоллекцияРеквизитовДокументаДляРазбивкиСтраниц() Экспорт
	
	КоллекцияРеквизитов = Новый СписокЗначений;
	
	КоллекцияРеквизитов.Добавить("Организация"           , "Организация");
	КоллекцияРеквизитов.Добавить("КонтрагентОтправитель" , "Хоз. субъект отправитель");
	КоллекцияРеквизитов.Добавить("ПредприятиеОтправитель", "Предприятие отправитель");
	КоллекцияРеквизитов.Добавить("КонтрагентПолучатель"  , "Хоз. субъект получатель");
	КоллекцияРеквизитов.Добавить("ПредприятиеПолучатель" , "Предприятие получатель");
	КоллекцияРеквизитов.Добавить("ТипТТН"                , "Тип ТТН");
	КоллекцияРеквизитов.Добавить("НомерТТН"              , "Номер ТТН");
	КоллекцияРеквизитов.Добавить("ДатаТТН"               , "Дата ТТН");
	КоллекцияРеквизитов.Добавить("Транспорт"             , "Транспорт");
	
	Возврат КоллекцияРеквизитов;
КонецФункции

Функция ПараметрыПечатиОбъекта(ТипОбъекта, Пользователь = Неопределено) Экспорт
	
	НастройкиПечати = Новый Структура("ВариантРазбивкиДокументовНаСтраницы, Настройки");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НастройкиПечатиОбъектов.ВариантРазбивкиДокументовНаСтраницы КАК ВариантРазбивкиДокументовНаСтраницы,
		|	НастройкиПечатиОбъектов.Настройки КАК Настройки,
		|	1 КАК Приоритет
		|ПОМЕСТИТЬ ПараметрыПечати
		|ИЗ
		|	РегистрСведений.НастройкиПечатиОбъектов КАК НастройкиПечатиОбъектов
		|ГДЕ
		|	НастройкиПечатиОбъектов.ТипОбъекта = &ТипОбъекта
		|	И НастройкиПечатиОбъектов.Пользователь = &Пользователь
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	НастройкиПечатиОбъектов.ВариантРазбивкиДокументовНаСтраницы,
		|	НастройкиПечатиОбъектов.Настройки,
		|	2
		|ИЗ
		|	РегистрСведений.НастройкиПечатиОбъектов КАК НастройкиПечатиОбъектов
		|ГДЕ
		|	НастройкиПечатиОбъектов.ТипОбъекта = &ТипОбъекта
		|	И НастройкиПечатиОбъектов.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МИНИМУМ(ПараметрыПечати.Приоритет) КАК Приоритет
		|ПОМЕСТИТЬ ТаблицаИтог
		|ИЗ
		|	ПараметрыПечати КАК ПараметрыПечати
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПараметрыПечати.ВариантРазбивкиДокументовНаСтраницы КАК ВариантРазбивкиДокументовНаСтраницы,
		|	ПараметрыПечати.Настройки КАК Настройки
		|ИЗ
		|	ТаблицаИтог КАК ТаблицаИтог
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыПечати КАК ПараметрыПечати
		|		ПО ТаблицаИтог.Приоритет = ПараметрыПечати.Приоритет
		|ГДЕ
		|	НЕ ТаблицаИтог.Приоритет ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ТипОбъекта"  , ТипОбъекта);
	Запрос.УстановитьПараметр("Пользователь", ?(ЗначениеЗаполнено(Пользователь), Пользователь, Справочники.Пользователи.ПустаяСсылка()));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		НастройкиПечати.ВариантРазбивкиДокументовНаСтраницы = "ВсеДокументыНаОдномЛисте";
	Иначе
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		НастройкиПечати.ВариантРазбивкиДокументовНаСтраницы = Выборка.ВариантРазбивкиДокументовНаСтраницы;
		НастройкиПечати.Настройки = Выборка.Настройки;
		
	КонецЕсли;
	
	Возврат НастройкиПечати;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура добавляет запись в регистр по переданным значениям структуры.
Процедура ДобавитьЗапись(СтруктураЗаписи, Загрузка = Ложь) Экспорт
	
	ОбменДаннымиСервер.ДобавитьЗаписьВРегистрСведений(СтруктураЗаписи, "НастройкиПечатиОбъектов", Загрузка);
	
КонецПроцедуры

// Процедура удаляет набор записей в регистре по переданным значениям структуры.
Процедура УдалитьЗапись(СтруктураЗаписи, Загрузка = Ложь) Экспорт
	
	ОбменДаннымиСервер.УдалитьНаборЗаписейВРегистреСведений(СтруктураЗаписи, "НастройкиПечатиОбъектов", Загрузка);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
